{"data":{"site":{"meta":{"title":"Keeley Hammond","description":"Personal site for Keeley Hammond","url":"https://keeleyhammond.com","author":"vertedinde","twitter":"keeleyhammond","adsense":""}},"post":{"id":"30fbfe85-6fa3-5ee5-a467-8dc7dddc3f93","html":"<p>It’s been a while since I updated this site, and I want to get better about charting out my accomplishments and keeping up with my React coding.</p>\n<!--more-->\n<p>So, this week, I: </p>\n<ul>\n<li>Set up a Windows CI/CD pipeline</li>\n<li>Wrote a risk assessment answer doc for our security team</li>\n<li>Figured out how to debug my functional tests not working after about 4 hours and several days of Googling - was is Robot.js, part of Electron’s framework? Was it electron-mocha? Turns out, it was just needing to <code class=\"language-text\">rm -rf node_modules</code> and reinstall with npm. Thank you, GitHub commentor on the electron-builder issues forum.</li>\n<li>Successfully deployed a full build to S3 and did it using SHA versioning.</li>\n<li>Successfully replicated a Go environment</li>\n<li>Learned about Go make files and vendoring vs <code class=\"language-text\">go get</code></li>\n</ul>\n<h3>Articles</h3>\n<p>Here are a few articles, podcasts and assorted things that I’ve enjoyed over the past week — give yourself a little mental boost on your Monday morning:</p>\n<ul>\n<li>Dev.To ran a good #devdiscuss this week about good and bad programming habits. <a href=\"https://dev.to/thepracticaldev/good-and-bad-dev-habits-from-perfectionism-and-to-git-commit-messages\">You can read some of the highlights here, or click the hashtag on Twitter.</a> </li>\n<li>Wired had an article this week that was getting passed around my Twitter timeline, <a href=\"https://www.wired.com/story/clive-thompson-tinker-with-code/\">about making code more tinkerer friendly.</a> I remember messing with my first bits of code on Xanga and Gaia Online, and love the concept.</li>\n<li>Speaking of tinker-friendly: I want to give a shout out to Glitch, which I just started using for a Leaflet project with Hack Oregon; <a href=\"https://glitch.com/edit/#!/grocery-geojson\">you can view and remix my project here.</a> Uses some QGIS and geoJSON, but would love people to tinker with it. </li>\n<li>Finally, I’ve been reviewing some JavaScript basics for a new project and <a href=\"https://dev.to/imwiss/understanding-hoisting-in-javascript\">found this excellent article on hoisting.</a> It covers a pretty basic concept, but was a good refresher. </li>\n</ul>\n<p>Have a great week, everybody!</p>","frontmatter":{"layout":"post","title":"VR Demos and Donut Photo Booths","path":"/this-week-sept-11/","category":"This Week","tags":null,"description":null,"date":"2017/09/11","image":null}}},"pageContext":{}}