{"data":{"site":{"meta":{"title":"Keeley Hammond","description":"Personal site for Keeley Hammond","url":"https://keeleyhammond.com","author":"vertedinde","twitter":"keeleyhammond","adsense":""}},"post":{"id":"31fe94e9-ca93-532a-bee1-3b3c8988b829","html":"<p>2017 was a year of huge changes. I changed careers, homes, added family members and finally became a software engineer.</p>\n<!--more-->\n<p>Testing adding a second paragraph here.</p>\n<h2>Professional</h2>\n<p>In January, I finally left Think Shift, the agency that had been my professional home for almost 7 years. It was hard to leave - I had a lot of great friends and several mentors who had helped me gain the career that I’d had. But I could also feel myself hitting a ceiling.</p>\n<p>What’s more, I didn’t just leave Think Shift for another job - I left Think Shift for an entirely different career.</p>\n<p>I joined Alchemy Code Lab in February for a five month, full-time JavaScript bootcamp. It was one of the most terrifying things I’ve ever done. I remember walking into the class on my first day (20 minutes early, a good habit I’d developed at Think Shift), looking around and wondering what in the hell I was doing.</p>\n<p>I graduated from Alchemy Code Lab in June and immediately went home to spend a week with my family in Ohio. They had a lot of questions: “So, where are you interviewing? Do you think you’ll have a job soon?”</p>\n<p>In August, I interviewed for a full-time position at InVision. I was so excited to work for them that I threw out anything - I was happy to take an internship, either paid or unpaid.</p>\n<h2>Community</h2>\n<p>At the end of 2016, I started attending more Women Who Code events in an effort to get to know the people that I would soon be working with. Toward the beginning of the year, I wanted to see the movie <em>Hidden Figures</em>, but didn’t have anyone who would go with me. So I posted in the Women Who Code slack channel:</p>\n<p>“Anyone want to go see Hidden Figures on Jan. 12?”</p>\n<p>Caterina asked me if I would like to host an event. So, I thought, why not?</p>\n<p>Caterina asked me to join the WWC leadership team in February, and I eagerly accepted. Starting in January of 2018, I am now the Open Source Lead for Women Who Code.</p>\n<h2>Personal</h2>\n<p>In September of 2016, Dave and I tied the knot after being together for 6 years. When I was about to leave Think Shift at the beginning of the year, we had several very serious and very heavy conversations. How would we manage going from a two income household to a single income one?</p>","frontmatter":{"layout":"post","title":"2017 Year In Review","path":"/review-of-2017/","category":"Personal","tags":["Year In Review"],"description":null,"date":"2018/01/13","image":null}}},"pageContext":{}}